{
  "slogan": "Next Generation Marketing Cloud",
  "description": "JuziBot opens up the mainstream IM and social media, helping enterprises and organizations establish a marketing system based on social relationships, efficiently reaching and deeply connecting tens of millions of customers.",
  "start-free": "Free Trial",
  "card-1-title": "Conversational Marketing Cloud",
  "card-1-subtitle": "impress customers in conversation. JuziBot helps you aggregate and manage customer conversation messages on multiple platforms to create a more efficient marketing cloud platform.",
  "card-2-title": "Large scale operation solution provider",
  "card-2-subtitle": "You can increase efficiency by 10 times, serve 200000 customers per capita, and provide your customers with a private domain experience of thousands of people and thousands of faces without any additional development.",
  "card-3-title": "Selected by pioneers in the industry",
  "card-3-subtitle": "JuziBot builds a private domain operation system for leading brands in education, consumer goods, beauty, mother and baby, offline stores and other industries, covering annual sales of 10-300 billion.",
  "feature-1-title": "Scalable Customer Migrations",
  "feature-1-subtitle": "Convert customer information into a private traffic pool",
  "feature-1-content": "Convert SMS, one-way messages into bilateral communications to build communicable social relationships automatically throughout multiple third party calling platforms and reduce the cost to 5 RMB per customer. ",
  "feature-2-title": "Accurate Communication",
  "feature-2-subtitle": "Large scale operation to manage millions of customers without human resources",
  "feature-2-content": "Based on RPA, chatting bots are live 24/7. Configure bots into multiple scenarios, processes to serve millions of different taste customers precisely, within a moment. ",
  "feature-3-title": "Rapid Response",
  "feature-3-subtitle": "Effortlessly replying customer messages from any platforms",
  "feature-3-content": "General platform reaches out to customers in multiple platforms such as Wechat, Tiktok, SMS, Whatsapp, etc.",
  "feature-4-title": "Effective Management",
  "feature-4-subtitle": "Turbo charged resources and performances",
  "feature-4-content": "Managing different profiles, regions, stages based on the business requirements, and independently evaluating performance, outputting in each unit, makes data visible to executives for global management.",
  "feature-5-title": "Data Driven",
  "feature-5-subtitle": "Make better decisions",
  "feature-5-content": "Performance of human resources and business data of growing, activeness and conversion are provided to improve the process and to make more strategic decisions.",
  "solution-title": "Focusing on solutions of effectiveness",
  "solution-1-title": "Effectively migrating customers to private traffic pools",
  "solution-1-content": "With less than 5 RMB per connection, phone bots reached million users without human interaction by diving into the customers pool, adding high willing customers automatically",
  "solution-2-title": "Providing best customer experience with standardized operations",
  "solution-2-content": "Jozi Bot provides standardized operations based on SOP. Apply best practice of operations to all your customers",
  "solution-3-title": "Creating user profilings to serve thousands of people in thousands of ways",
  "solution-3-content": "Send posts to customers based on their interest and tags which are created in different dimensions automatically based on preset policies.",
  "solution-4-title": "Driving executives by data",
  "solution-4-content": "Data platform provides statistics in multiple dimensions, from growth to interaction, from the performance of employees to the conversions of the sales. Let data drive your decision; let performance support your management.",
  "company-display-title": "Now, you can be one of them",
  "company-read-more": "More →",
  "company-1-title": "3 Million",
  "company-1-subtitle": "Number of customers contacted by 15 agents",
  "company-1-name": "A household mending company",
  "company-1-brief": "Provide services to 3 million customers with a 15-agent team, with each agent chatting 500 times, with Jozi Bot.",
  "company-1-comment": "",
  "company-2-title": "20,000",
  "company-2-subtitle": "Customers/day",
  "company-2-name": "A local brand",
  "company-2-brief": "Services cover over 600 cities and counties, and achieved over 2.5 million total visits with average daily new customers over 20 thousands, by migrating Jozi Bot.",
  "company-2-comment": "",
  "company-3-title": "15+",
  "company-3-subtitle": "ROI",
  "company-3-name": "A maternal and infant business",
  "company-3-brief": "After migrating to Jozi Bot, the service radius has been increased to 1:1,000,000, and monthly GMV reaches as much as 10 million.",
  "company-3-comment": "",
  "company-4-title": "99.9%",
  "company-4-subtitle": "Availability",
  "company-4-name": "A government platform",
  "company-4-brief": "5 million users have been migrated to Jozi Bot, with over 70000 messages back and forth day by day.",
  "company-4-comment": "",
  "appeal-title": "Building saling relationships based on social relations starting today",
  "appeal-start-free": "Free Trial"
}
